Repository: pedrofveloso/pdfv-app
Catalog: pdfv-app/Resources/Localizable.xcstrings
Source language: en
Languages: pt_br

source: about-me-chess-invite
pt_br: Se quiser jogar comigo basta colar lá no https://www.chess.com/member/pedrocabrz

source: about-me-description
pt_br: Queria começar me apresentando: Me chamo Pedro Veloso, tenho %d anos e sou natural de Recife/PE mas moro em São Paulo desde 2018. Sou casado com a Beatriz, e tutor da Tutti a SRD mais linda deste planeta inteiro.

source: about-me-hobbies
pt_br: Meu principal hobby é o xadrez (pelo menos ultimamente). Sou o que chamam dentro do esporte de capivara, o equivalente ao que chamamos no nordeste de _perronha_ no futebol.

# about-me-title
source: About me
pt_br: Sobre mim

source: career-beyond-technical
pt_br: Para além do técnico

source: career-companies
pt_br: Ja trabalhei para várias empresas, de diferentes tamanhos e diferentes setores, isso me fez conhecer muitas tecnologias diferentes o que eu acho bem bacana.

source: career-conclusion
pt_br: É isso! Esse sou eu. Aos que leram até aqui, espero que tenham curtido um pouco da minha história! Se quiser bater um papo, é só me chamar! Um forte abraço!

source: career-intro
pt_br: Considero que comecei minha carreira como desenvolvedor de sistemas em 2011. Há longínquos %d anos atrás. Tenho muito orgulho em dizer que já trabalhei com muitas tecnologias diferentes.

source: career-ios
pt_br: O foco da minha carreira é desenvolvimento iOS, no qual eu tenho pouco mais de %d anos de experiência no total, dos quais %d anos tem sido com desenvolvimento Swift e 1 ano e alguns meses com desenvolvimento em Objective-C.

source: career-js
pt_br: Dentre as tecnologias em questão eu gosto muito de citar JS (JavaScript). Eu tenho um carinho especial pela linguagem. Não sou um ninja nessa stack, mas consigo me virar bem. A maioria das coisas que faço fora do mundo iOS é em JS, principalmente quando me aventuro no back-end utilizando node.

source: career-leadership
pt_br: Em 2024 eu tive a minha primeira experiência como tech lead e posteriormente como team lead. Foi uma experiência diferente. Após alguns meses nesses papeis eu entendi que a parte de liderança de projetos não é algo que me brilha os olhos. Foi algo que, apesar de ter um bom desempenho, eu não fazia com tanta naturalidade quanto ser desenvolvedor ou gestor de pessoas. Foi neste momento que decidi “voltar à minha carreira de desenvolvedor” e focar naquilo que eu faço com mais naturalidade.

source: career-people-management
pt_br: Em 2023 eu tive a minha primeira oportunidade de trabalhar como gestor de pessoas. Eu realmente gostei bastante desse papel. Acho que uma das minhas grandes fortalezas é a troca de experiências, coisa que é importantíssima numa relação de gestão. Dentre as minhas responsabilidades estavam fazer 1:1s recorrentes, dar feedbacks, PDIs/Growth areas, avaliação de performance e outras atividades mais burocráticas. Eu cheguei a ter 5 pessoas sob minha gestão, e me orgulho demais do trabalho feito, o qual me rendeu ótimos feedbacks. Essa parte de gestão de pessoas eu realmente gostei muito de fazer, e é algo que eu gostaria de fazer novamente em minha carreira.

source: career-technical
pt_br: Técnico

source: career-title
pt_br: Carreira

source: career-tools
pt_br: Para além disso tenho experiência com CI/CD (Bitrise, Github actions e Fastlane), testes unitários e de UI (XCTest e Quick/Nimble) e metodologias ágeis (Scrum e Kanban).

source: education-description
pt_br: Sou formado em Sistemas de Informação pela UFRPE. A melhor faculdade em linha reta do Brasil, segundo eu mesmo. Tenho muito carinho pela faculdade e pelos amigos que fiz durante os longos 10 anos de curso. Sim, demorei isso tudo. Entre trabalhos, desistências e mudanças de áreas, consegui me formar em 2019.

source: education-title
pt_br: Formação
